testAme/labs/lab5/combustor2D_spray/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
15677
(
84.7395
23.4023
71.2246
9.39537
34.5734
72.5579
5.05743
16.0411
...
)
;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.02;
        value           uniform 2;
    }
    outlet
    {
        type            zeroGradient;
    }
    splitter
    {
        type            epsilonWallFunction;
        value           uniform 2;
    }
    fuel_inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.02;
        value           uniform 2;
    }
    back
    {
        type            epsilonWallFunction;
        value           uniform 2;
    }
    sides
    {
        type            epsilonWallFunction;
        value           uniform 2;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
