testAme/labs/lab5/combustor2D_spray/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
15677
(
0.000101845
0.000509487
8.56045e-05
0.00129481
0.000375775
8.72164e-05
0.00242837
0.000779282
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    splitter
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    fuel_inlet
    {
        type            calculated;
        value           uniform 0;
    }
    back
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    sides
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
